Revit 2027 API
GlobalParameter.HasValidTypeForReporting Method
 Tests that the global parameter has data of a type that supports reporting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidTypeForReporting()
Public Function HasValidTypeForReporting As Boolean
public:
bool HasValidTypeForReporting()
member HasValidTypeForReporting : unit -> bool
Return Value
Boolean
 True if the parameter has data of a type that supports reporting; False otherwise.
Remarks
 Only few data types can be used for reporting parmeters. Currently, reporting global parameters must be either of type Lenght or Angle - basically, they need to be value-driven by standard dimensions.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace